do

function run(msg, matches)
  return 'help persian '.. HELPFA .. [[ لیست دستورات :

!kick [username|id]
برای کيک کردن فرد از گروه 

!ban [ username|id]
برای بن کردن فرد از گروه

!unban [id]
آن بن سازی فرد
*براي هر سه امکان بالا ميتوانيد از ريپلاي هم استفاده کنيد*

!who
دريافت ليست اعضا به صورت فايل

!wholist
دريافت ليست اعضا به صورت مسيج

!modlist
دريافت ليست مديريت گروه

!promote [username]
برای ارتقای فرد به مدیر

!demote [username]
گرفتن مقام مدیر

!kickme
برای کيک کردن خود از گروه 

!about
برای دريافت توضيحات گروه

!setphoto
برای تنظيم عکس و قفل کردن آن

!setname [name]
برای تنظيم اسم گروه و قفل کردن آن

!rules
قوانین گروه

!id
برای دريافت ايدی فرد  و ایدی گروه 

!help
راهنمای دستورات به زبان انگلیسی
!helpfa
راهنمای دستورات به زبان  فارسی

!lock [member|name|bots]
قفل کردن اعضا - نام گروه -ربات

!unlock [member|name|photo|bots]
بازکردن قفل اعضا - نام  گروه - آواتار گروه -ربات

!set rules <text>
برای تنظيم قانون برای گروه

!set about <text>
برای تنظيم توضيح برای گروه

!settings
برای دريافت تنظيمات گروه

!newlink
برای ساخت/تعويض لينک گروه

!link
برای دريافت لينک گروه

!owner
برای دريافت اونر گروه 

!setowner [id]
برای تنظيم اونرگروه

!setflood [value]
برای تنظيم حداقل فلود اسپم

!stats
برای گرفتن آمار پیام های ارسالی گروه به صورت فایل متنی
!statslist
برای گرفتن آمار پیام های ارسالی گروه به صورت پیام

!save [value] <text>
برای ذخیره یک متن

!get [value]
برای دریافت متن

!clean [modlist|rules|about]
برای پاک کردن قوانين،توضيح و مدير هاي گروه

!res [username]
برای دريافت ايدی فرد
"!res @username"

!log
دریافت  اخرین دستورات وارد شده در گروه

!banlist
برای دریافت لیست بن شده های گروه

!all
برای دریافت تمامی اطلاعات گروه 

**شما میتوانید استفاده  کنید از "/" و "!" 


*تنها اونر ها و مدير های گروه ميتوانند ربات ادد کنند


*تنها اونر ها و مدير ها ميتوانند از کيک،بن،ان بن،لينک جديد،قفل عکس،اعضا و نام گروه و برداشتن قفل عکس،اعضا و نام گروه،استفاده  کنند وقوانين ،توضيحات و تنظيمات گروه را تغییر دهند

*تنها اونر ها میتوانند از res,setowner,promote,demote andو log استفاده کنند


پایان ]]
end

return {
  description = "Shows bot help persian", 
  usage = "!helpfa: Shows bot help persian",
  patterns = {
    "^[!/](helpfa)$"
  }, 
  run = run 
}

end
